Merge pull request #3 from jonathanscholtes/dev
Fix logging and update README for Chaos testing
